{"data":{"site":{"siteMetadata":{"title":"Book Notes by Tiffany","subtitle":"I'm Tiffany, a software developer who likes books. I write about them here.","author":{"name":"Tiffany White","twitter":"tiffanywhitedev"},"disqusShortname":"","url":"https://booknotesbytiffany.net"}},"markdownRemark":{"id":"4e16d814-d151-5ace-a366-ec2ab5f30b20","html":"<p><a href=\"https://www.goodreads.com/book/show/13641406-paperless\"><img src=\"https://images.gr-assets.com/books/1336601091m/13641406.jpg\" alt=\"Paperless: A MacSparky Field Guide\"></a><a href=\"https://www.goodreads.com/book/show/13641406-paperless\">Paperless: A MacSparky Field Guide</a> by <a href=\"https://www.goodreads.com/author/show/6870018.David_Sparks\">David Sparks</a>\nMy rating: <a href=\"https://www.goodreads.com/review/show/983548727\">5 of 5 stars</a></p>\n<p>I’ve been an avid listener of the Mac Power Users podcast since jumping over to the Apple cult, even before I got my first Mac, as a sort of primer on what tools and apps to get and use. David is the host along with Katie Floyd and in my opinion carries the show. So when I saw that he had some books on the iBookstore, I knew I had to buy them.</p>\n<p>First, let me say, this is Mac-centric and his disdain for Windows machines shines through in the one page dedicated to Windows apps. I get that but I think he alienates some potential readers who own iOS devices AND Windows machines. He’s a lawyer making money from that gig so I doubt he cares one whit who he alienates with this book. Just a warning for all you PC people who are thinking about buying it.</p>\n<p>That said, I gained a lot, a TON of knowledge about the Mac and Automator, as well as specific workflow examples with Hazel. TextExpander, which expands small snippets of text into whatever you can think of, was mentioned as a way to name files, as well as Automator, and Hazel. I found the overlap of these workflows to be daunting and I wish he had lain out a specific use case for each naming workflow. There were only sparse mentions of each separate use case and plenty of overlap.</p>\n<p>I will say he loves his apps. I have app choices and they weren’t affected by his recommendations and he didn’t hawk his choices too much, leaving you to choose pretty much whatever you like.</p>\n<p>The multimedia and interactivity made this book a pleasure to read— I read it in one day. The layout was funky but it was extremely well-designed, nothing like some of the self-published “books” you can get these days. It’s a beautiful book and for that alone it deserves 5 stars but the content is useful and practical if not costly. Great, quick, read.</p>\n<p><a href=\"https://www.goodreads.com/review/list/1940314-tiffany\">View all my reviews</a></p>","fields":{"tagSlugs":["/tags/apple/","/tags/mac/","/tags/macos/","/tags/paperless-systems/","/tags/macsparky/","/tags/david-sparks/","/tags/2014/","/tags/goodreads/"]},"frontmatter":{"title":"Paperless: MacSparky's Finest Book","tags":["apple","mac","macos","paperless systems","macsparky","david sparks","2014","goodreads"],"date":"2014-07-06","description":"David is the host of Mac Power Users along with Katie Floyd and in my opinion carries the show. So when I saw that he had some books on the iBookstore, I knew I had to buy them."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/paperless/"}}