{"data":{"site":{"siteMetadata":{"title":"Book Notes by Tiffany","subtitle":"I'm Tiffany, a software developer who likes books. I write about them here.","author":{"name":"Tiffany White","twitter":"tiffanywhitedev"},"disqusShortname":"","url":"https://booknotesbytiffany.net"}},"markdownRemark":{"id":"2000143a-f3bc-5e20-a854-f40c5e98a629","html":"<p><a href=\"https://www.goodreads.com/book/show/13573685-the-charge\"><img src=\"https://images.gr-assets.com/books/1350302188m/13573685.jpg\" alt=\"The Charge: Activating the 10 Human Drives That Make You Feel Alive\"></a><a href=\"https://www.goodreads.com/book/show/13573685-the-charge\">The Charge: Activating the 10 Human Drives That Make You Feel Alive</a> by <a href=\"https://www.goodreads.com/author/show/588158.Brendon_Burchard\">Brendon Burchard</a>\nMy rating: <a href=\"https://www.goodreads.com/review/show/1576871522\">1 of 5 stars</a></p>\n<p>I read the description of the book and had my doubts— it was a $5.99-er from Audible which should have told me all I needed to know. I had $6 to burn so I bought it.</p>\n<p>I shouldn’t have.</p>\n<p>See, the problem with these kinds of books, as well as the lives of Content Marketers I follow, is that they automatically assume people wake up every morning unmotivated to change their own lives and financial circumstances; that getting super rich is the only way to lead a fulfilling life. I get this vibe from so many Content Marketers— from Gary Vee, Pat Flynn, John Somnez who is a Content Marketer who moonlights as a programmer. The tactics of Content Marketers bother me and seem like snake oil. This book is for people like Gary Vee and Pat Flynn and the If-you-don’t-wake-up-at-the-crack-of-dawn-and-write-a-book-you’ll-never-be-successful types of overly precious articles by 20 somethings on Medium.</p>\n<p>I am old enough and jaded enough to know half of this stuff is complete bullshit.</p>\n<p>Do I want to have a lot of money? Sure. But there are other methods to go about it than these steps laid out in this book. The call to action to live a “charged” life is dubious at best. A charged life by whose standards? Burchard’s? Nahhh.</p>\n<p>He uses the term neuroscience quite loosely. He also turned me off with that pseudoscience word salad about health and diet. Another turn off was bringing spirituality into it but most of these books do that, and for me that’s a star deducted.</p>\n<p>Honestly, I should have listened to my gut and saved the $6. Waste of time.</p>\n<p><a href=\"https://www.goodreads.com/review/list/1940314-tiffany\">View all my reviews</a></p>","fields":{"tagSlugs":["/tags/productivity/","/tags/guru-bullshit/","/tags/the-charge/","/tags/goodreads/","/tags/brendon-burchard/","/tags/2016/"]},"frontmatter":{"title":"The Charge: Happiness Guru Bullshit","tags":["productivity","guru bullshit","the charge","goodreads","brendon burchard","2016"],"date":"2016-03-11","description":"I read the description of the book and had my doubts-- it was a $5.99-er from Audible which should have told me all I needed to know. I had $6 to burn so I bought it.I shouldn't have."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-charge-is-bullshit/"}}