{"data":{"site":{"siteMetadata":{"title":"Book Notes by Tiffany","subtitle":"I'm Tiffany, a software developer who likes books. I write about them here.","author":{"name":"Tiffany White","twitter":"tiffanywhitedev"},"disqusShortname":"","url":"https://booknotesbytiffany.net"}},"markdownRemark":{"id":"baa146b7-c747-58b4-a2c9-590e5981b5c3","html":"<p><a style=\"float: left; padding-right: 20px;\" href=\"https://www.goodreads.com/book/show/25703680\"><img src=\"https://d.gr-assets.com/books/1443169433m/25703680.jpg\" alt=\"The Master Algorithm: How the Quest for the Ultimate Learning Machine Will Remake Our World\" border=\"0\"></a>\n<a href=\"https://www.goodreads.com/book/show/25703680\">The Master Algorithm: How the Quest for the Ultimate Learning Machine Will Remake Our World</a> by <a href=\"https://www.goodreads.com/author/show/3242685\">Pedro Domingos</a>\nMy rating: <a href=\"https://www.goodreads.com/review/show/1535488112\">2 of 5 stars</a></p>\n<p>This book presupposes that there is a master algorithm to be found in the field of Artificial Intelligence. That while computers will become anything but sentient, they will essentially make half the workforce obsolete. The author’s laissez faire attitude about this bothers me. He’s encouraging this.</p>\n<p>I understand the excitement surrounding machine learning — we have Google Now, Siri, Amazon Echo, etc that understand what we want before we actually want it and as a developer, robotics fan, and data junkie, this excites me too.</p>\n<p>But for years we’ve been excited by AI and machine learning, much like the resurgent VR. This is the new tech hotness. But where I take issue with this book is it looking so far into the future for a master algorithm that we can’t even quantify right now and that, once we do, the loss of physical jobs to our Amazon Echo overlords is welcome by not just Domingos but most machine learning gurus.</p>\n<p>Will we find a way to replace those lost jobs for the people it will affect? Who knows. The fact that it doesn’t cross Domingos mind to give this dilemma more than a cursory mention gives this book an air of arrogance that I find distasteful. 2 stars.</p>\n<p><a href=\"https://www.goodreads.com/review/show/1535488112\">View all my reviews</a></p>","fields":{"tagSlugs":["/tags/ai/","/tags/machine-learning/","/tags/algorithms/","/tags/pedro-domingos/","/tags/2016/","/tags/goodreads/"]},"frontmatter":{"title":"The Master Algorithm","tags":["ai","machine learning","algorithms","pedro domingos","2016","goodreads"],"date":"2016-04-03","description":"This book presupposes that there is a master algorithm to be found in the field of Artificial Intelligence. That while computers will become anything but sentient, they will essentially make half the workforce obsolete. The author's laissez faire attitude about this bothers me."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-master-algorithm-review/"}}