{"data":{"site":{"siteMetadata":{"title":"Book Notes by Tiffany","subtitle":"I'm Tiffany, a software developer who likes books. I write about them here.","author":{"name":"Tiffany White","twitter":"tiffanywhitedev"},"disqusShortname":"","url":"https://booknotesbytiffany.net"}},"markdownRemark":{"id":"d022ec86-688b-54a4-8e7a-463a62721e47","html":"<p><a href=\"https://www.goodreads.com/book/show/16041846-in-the-house-upon-the-dirt-between-the-lake-and-the-woods\"><img src=\"https://images.gr-assets.com/books/1349510041m/16041846.jpg\" alt=\"In the House Upon the Dirt Between the Lake and the Woods\"></a><a href=\"https://www.goodreads.com/book/show/16041846-in-the-house-upon-the-dirt-between-the-lake-and-the-woods\">In the House Upon the Dirt Between the Lake and the Woods</a> by <a href=\"https://www.goodreads.com/author/show/18555172.Matt_Bell\">Matt Bell</a>\nMy rating: <a href=\"https://www.goodreads.com/review/show/651969031\">3 of 5 stars</a></p>\n<p>More like 3.75/5. The beginning of the book is quite good- we get a sense of urgency quite quickly which does the novel some good as in the middle and towards the end the plot begins to sag.</p>\n<p>The voice of the narrator…I don’t know how I feel about it. The language was simple, sentences clipped, but primitive, and I get why Matt chose to write it like this- it’s a fairy tale, a dark, twisted, original Brothers Grimm type story and because of this the story needs this type of narration. I’m just not sure if it was for me.</p>\n<p>The middle of the book sagged a little bit. I don’t know if it was repetitive as some reviewers have said- I wasn’t finding that but it just didn’t excite me like the beginning, although every time I opened it up and started to read, Matt held my attention, until…</p>\n<p>The first scene with the squid. When I started reading that my immediate thought was “what the fuck am I reading?” and that was the sentiment for most of that scene and the scenes to follow. This is not the genre I usually read and I have read some great fantasy but this seemed overwrought and full of symbols and I am not sure it pays off in the end. Half of it was lost on me because there was just so much. I am not the most critical reader, so I may be handicapped in that respect. But I get it. Matt is extremely talented. But it just seemed heavy handed to me.</p>\n<p>I love Matt’s work and this is no exception but on a different, perhaps less of an immediate level. It has reread value only because I am an English major and literary analysis is my weak point. I figure if I can work the stuff out in this novel I might have a shot at an A. :-)</p>\n<p><a href=\"https://www.goodreads.com/review/list/1940314-tiffany\">View all my reviews</a></p>","fields":{"tagSlugs":["/tags/magical-realism/","/tags/abstract/","/tags/2013/","/tags/goodreads/","/tags/matt-bell/"]},"frontmatter":{"title":"In the House Upon the Dirt Between the Lake & the Woods: Disappointing First Effort","tags":["magical realism","abstract","2013","goodreads","matt bell"],"date":"2013-06-13","description":"The beginning of the book is quite good- we get a sense of urgency quite quickly which does the novel some good as in the middle and towards the end the plot begins to sag."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/in-the-house-upon-the-dirt/"}}