{"data":{"site":{"siteMetadata":{"title":"Book Notes by Tiffany","subtitle":"I'm Tiffany, a software developer who likes books. I write about them here.","author":{"name":"Tiffany White","twitter":"tiffanywhitedev"},"disqusShortname":"","url":"https://booknotesbytiffany.net"}},"markdownRemark":{"id":"50d2b1d2-c5cd-561e-a4d8-ae35ea0870f2","html":"<p><a href=\"https://www.goodreads.com/book/show/292327.The_Bluest_Eye\"><img src=\"https://images.gr-assets.com/books/1492591342m/292327.jpg\" alt=\"The Bluest Eye\"></a><a href=\"https://www.goodreads.com/book/show/292327.The_Bluest_Eye\">The Bluest Eye</a> by <a href=\"https://www.goodreads.com/author/show/3534.Toni_Morrison\">Toni Morrison</a>\nMy rating: <a href=\"https://www.goodreads.com/review/show/194525592\">5 of 5 stars</a></p>\n<p>I don’t give a lot of five stars. But this one deserved it, if only for the poetic flow of her prose, the imagery. I fell madly in love with the metaphors- the blue eyes for a universal beauty that the ugly black girl Pecola Breedlove could never have, clean/white things for white people, beauty. In one passage she writes the character Claudia been cleaned, scrubbing “the ink” (blackness) off of her. There were other metaphors as well but these are the ones that stood out.</p>\n<p>We don’t get to see much of the sisters, Claudia and Freida who befriend the subject of the story, Pecola Breedlove, the girl who felt so unnoticed and ugly that she wanted Blue eyes. Pecola comes from a poor, broken home, where her dad and mom physically fight each other in one turn and make love the next. Kids pick on Pecola. There was even a girl, a Mulatto girl, who pretends to befriend Pecola after Pecola was picked on in the school yard by several boys. The Mulatto girl is pretty with green eyes. She takes Pecola, Claudia and Freida for ice cream but doesn’t treat the two sisters. She treats Pecola, and then sneakily puts in a jab, the same jab the boys had before they left for the ice cream shop, “Pecola seen her daddy nekked” only she did it on the sly.</p>\n<p>I felt that Pecola’s life was so miserable- there wasn’t anything happy about her existence. At all. The catalyst for her was just awful. Her father rapes her and impregnates her. But Morrison handles this with a deftness I don’t think any other writer could pull off. It is in the chapter where we get to know about the past of Cholly Breedlove, Pecola’s father. There is a section break and the rape happens. Because we know why Cholly is a drunk, violent, nobody, and because Morrison explains Cholly’s motives, which aren’t good but they make you empathize with him, at least for a moment, the whole rape scene is not as painful as it could have been. Pecola is 11 and has already had her period, which there is a scene of this earlier in the novel. We don’t know how old Cholly is.</p>\n<p>I really wish there was more, something happier for Pecola other than the prostitutes whose home she hung out in. The whores gave her soda and candy, told her stories. But we were only introduced to them briefly. I would have liked to have seen more interaction between Pecola and the prostitutes.</p>\n<p>Also, although I liked the imagery and metaphor, it got a bit heavy handed in the second chapter. I was starting to get weary of it. I don’t know. Maybe I was tired but I would read lines and think, “What the fuck is she trying to say?” But I didn’t feel that way at all during the rest of the book. 5 stars.</p>\n<p><a href=\"https://www.goodreads.com/review/list/1940314-tiffany\">View all my reviews</a></p>","fields":{"tagSlugs":["/tags/black-fiction/","/tags/classics/","/tags/women-writers/","/tags/2011/","/tags/toni-morrison/","/tags/goodreads/"]},"frontmatter":{"title":"The Bluest Eye by Toni Morrison","tags":["black fiction","classics","women writers","2011","toni morrison","goodreads"],"date":"2011-08-04","description":"I don't give a lot of five stars. But this one deserved it, if only for the poetic flow of her prose, the imagery."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-bluest-eye/"}}